test/setup_saddes/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 5e-5;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            zeroGradient;
    }

    upperWall
    {
        //type            zeroGradient;
	type            nutUSpaldingWallFunction;
	tolerance       1e-9;
        value           uniform 5e-5;
    }

    lowerWall
    {
        //type            zeroGradient;
	type            nutUSpaldingWallFunction;
        tolerance       1e-9;
        value           uniform 5e-5;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
