test/setup_saddes/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          10;
        startFace       1950;
    }
    outlet
    {
        type            patch;
        nFaces          17;
        startFace       1960;
    }
    upperWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          63;
        startFace       1977;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          70;
        startFace       2040;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          2030;
        startFace       2110;
    }
)

// ************************************************************************* //
