test/setup_saddes/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
        p
        {
                solver Ginkgo;
                configFile config.bj.json;
        }

        pFinal
        {
                $p;
        }

        Phi
        {
                $p;
        }

	U
        {
            solver PBiCGStab;
            preconditioner diagonal;
            tolerance 0;
            relTol 1e-10;
        }
        nfU
        {
                solver Ginkgo;
                configFile config.bicgstab.json;
        }

        UFinal
        {
                $U;
        }

	nuTilda
        {
            solver PBiCGStab;
            preconditioner diagonal;
            tolerance 0;
            relTol 1e-10;
        }
        nfNuTilda
        {
                solver Ginkgo;
                configFile config.bicgstab.json;
        }
        nuTildaFinal
        {
                $nuTilda;
        }
/*    p
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0.1;
        smoother        GaussSeidel;
    }

    pFinal
    {
        $p;
        smoother        DICGaussSeidel;
        tolerance       1e-06;
        relTol          0;
    }

    "(U|nuTilda|k|B|s)"
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-05;
        relTol          0;
    }
    U
    {
        solver PBiCGStab;
        preconditioner DILU;
        tolerance 0;
        relTol 0.01;
        maxIter 5;
    }   */
}

PISO
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
}


// ************************************************************************* //
