test/setup_saddes/system/fvSolution.NEON
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
        p
        {
                solver Ginkgo;
                configFile config.bj.json;
        }

        pFinal
        {
                $p;
        }

        Phi
        {
                $p;
        }

	U
        {
            solver PBiCGStab;
            preconditioner diagonal;
            tolerance 0;
            relTol 1e-10;
        }
        nfU
        {
                solver Ginkgo;
                configFile config.bicgstab.json;
        }

        UFinal
        {
                $U;
        }

	nuTilda
        {
            solver PBiCGStab;
            preconditioner diagonal;
            tolerance 0;
            relTol 1e-10;
        }
        nfNuTilda
        {
                solver Ginkgo;
                configFile config.bicgstab.json;
        }
        nuTildaFinal
        {
                $nuTilda;
        }
}

PISO
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
}


// ************************************************************************* //
